### DataFrame에서 원소/요소 데이터 변경
- 행 방향 추가
- 열 방향 추가

In [2]:
# 모듈 로딩
import pandas as pd

In [3]:
# 데이터 준비
data={'name': ['홍길동','마징가','원더우먼'],
      'job':['의적','로봇','영웅'],
      'gender':['남','남','여'],
      'age':[100, 200, 300],
      'height':[180, 300, 200]}

In [4]:
# DF으로 데이터 저장
dataDF=pd.DataFrame(data)
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

- [원소/요소 값 변경]

In [12]:
## 홀길동의 성별을 '남' ===> '여'
# 1. 현재 홍길동의 성별 추출 loc[행][열] iloc[행, 열](iloc은 정수로)
dataDF.loc[0]['gender'], dataDF.loc[0][2], dataDF.iloc[0,2]

C:\Users\KDP-23\AppData\Local\Temp\ipykernel_13012\1318975453.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  dataDF.loc[0]['gender'], dataDF.loc[0][2], dataDF.iloc[0,2]

('여', '여', '여')

In [6]:
# 2. '남' ===> '여' 변경
dataDF.iloc[0,2] = '여'
dataDF

   name job gender  age  height
0   홍길동  의적      여  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

In [7]:
## 원더우먼의 직업을 직장인으로 변경
dataDF.iloc[2,1] = '직장인'
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100     180
1   마징가   로봇      남  200     300
2  원더우먼  직장인      여  300     200

- [행 전체 값 변경]

In [8]:
# 행 전체 선택 => 변수명.iloc[정수]/ 변수명.loc['라벨명']
# 마징가행 (1번행) 추출
dataDF.iloc[1]

name      마징가
job        로봇
gender      남
age       200
height    300
Name: 1, dtype: object

In [9]:
# 1번행 값 변경 ===> 컬럼 개수 == 데이터 개수
dataDF.iloc[1]=['마징가','영웅', '여', 90, 170]
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100     180
1   마징가   영웅      여   90     170
2  원더우먼  직장인      여  300     200

In [10]:
# 1번행 값 변경 ==> 1개 == 데이터 개수
dataDF.iloc[1]=0
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100     180
1     0    0      0    0       0
2  원더우먼  직장인      여  300     200

In [14]:
dataDF.height= 0 # >> columns은 매서드처럼 입력하고 변환 가능
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100       0
1     0    0      0    0       0
2  원더우먼  직장인      여  300       0

In [15]:
dataDF.columns=['남자','여자','크레파스',80,80]
dataDF

     남자   여자 크레파스   80  80
0   홍길동   의적    여  100   0
1     0    0    0    0   0
2  원더우먼  직장인    여  300   0

In [19]:
dataDF.크레파스='안녕'
dataDF

     남자   여자 크레파스   80  80
0   홍길동   의적   안녕  100   0
1     0    0   안녕    0   0
2  원더우먼  직장인   안녕  300   0

In [21]:
dataDF.[80]='우째?' # 이건 안되네???ㅋㅋㅋㅋㅋ

SyntaxError: invalid syntax (2761913135.py, line 1)